import csv

# 分类：输入一个图片的分辨率，判断该图片是横或者纵向图片
# x1,x2分别是图片分辨率的横和纵向的像素长度，y是标签，1代表是横向图片，-1代表纵向图片
data = [
    ["x1","x2","y"],
    [153,432,-1],
    [220,262,-1],
    [118,214,-1],
    [474,384,1],
    [485,411,1],
    [233,430,-1],
    [396,361,1],
    [484,349,1],
    [429,259,1],
    [286,220,1],
    [399,433,-1],
    [403,340,1],
    [252,34,1],
    [497,472,1],
    [379,416,-1],
    [76,163,-1],
    [263,112,1],
    [26,193,-1],
    [61,473,-1],
    [420,253,1]
    ]

# 打开一个 dataset1.csv 的文件，没有就创建，用于把 data变量的内容生成 .csv文件dataset1
# "w" 代表写入模式， newline="" 避免出现空行
with  open("dataset1.csv", "w", newline = "") as file:
    writer = csv.writer(file)   # 创建一个csv.writer()的对象
    writer.writerows(data)      # 行写入

# 打开生成的 .csv文件， 只读方式， 打印预览
with open("dataset1.csv","r") as file:
    content = file.read()
    print(content)